Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/working_abroad/working_outside_the_eu.html.txt.tmx
Source language: en
Languages: ga

source: Working outside the EU
ga: Ag obair taobh amuigh den AE

source: • Finding out information about other countries
ga: • Faigh amach eolas faoi thíortha eile

source: • What to do before you leave
ga: • Cad atá á dhéanamh agat roimh imeacht duit

source: Working in another country can be a very rewarding experience and a great way of broadening your horizons and career prospects
ga: Is dea-thaithí é a bheith ag obair i dtír eile agus is bealach an-mhaith é chun do thaithí saoil agus do dhul chun cinn sa saol oibre a fheabhsú

source: Working outside the EU will involve travel to new places and may offer the opportunity to try a new career or to use and develop an existing skill or qualification
ga: Beidh taisteal go háiteanna nua i gceist le hobair taobh amuigh den AE agus is féidir go dtabharfadh sé an deis duit slí beatha nua a thriáil nó scil nó cáilíocht atá agat a fhorbairt

source: It is important to remember from the start however, that finding a job in another country can be time consuming and will require determination and careful thought and planning in advance
ga: Tá sé tábhachtach a chuimhniú ón tús, áfach, gur féidir leis go leor ama a ghlacadh post a fháil i dtír eile agus go dtógfaidh sé diongbháilteacht agus smaoineamh cúramach agus réamhphleanáil

source: What you need to know before you go
ga: Cad a bheith ar eolas agat sula dtéann tú thar lear

source: If you have made the decision that you want to work outside the EU or if you are being posted there through your current employment, you will have to take into account some important issues that you may not have to consider when working in the EU
ga: Má tá an cinneadh déanta agat go bhfuil tú ag iarraidh oibriú taobh amuigh den AE nó go bhfuil tú dod' chur ann tríd an fhostaíocht atá agat faoi láthair, ní mór duit mar shampla roinnt saincheisteanna tábhachtacha a thógáil san áireamh nach mbeadh ort smaoineamh orthu agus tú ag obair san AE

source: For example, you may require a working visa or work permit before you can commence working in your chosen country
ga: Mar shampla, is féidir go dteastódh víosa oibre nó ceadúnas oibre uait sular féidir leat tosnú ag obair sa tír atá roghnaithe agat

source: It is also useful to bear in mind other differences, such as language, culture and climate
ga: Is buntáiste atá ann smaoineamh ar dhifríochtaí eile, ar nós teanga, cultúr agus aeráid

source: There may also be significant differences in work practices, working hours and job application methods
ga: Is féidir go mbeadh difríochtaí suntasacha i gcleachtais oibre, uaireanta oibre agus i mbealaí chun cur isteach ar phost

source: Finding out information about other countries
ga: Faigh amach eolas faoi thíortha eile

source: When you have decided on a particular country you should research the work opportunities and possibilities and find out whether you will require a visa or work permit
ga: Má tá tír áirithe cinnte agat, ba chóir duit taighde ar na deiseanna agus seansanna oibre a dhéanamh agus á fáil amach an bhfuil gá duit víosa nó cead oibre a bheith agat

source: You can check all this information in advance by getting in touch with the embassy or consulate of the country to which you will be travelling
ga: Is féidir leat an t-eolas seo go léir a sheiceáil roimh ré tré dul i dteagmháil le hambasáid/consalacht na tíre a bhfuil tú ag taisteal chuici

source: There is a list of foreign embassies in Ireland on the Department of Foreign Affairs and Trade website
ga: Tá liosta iomlán de na ambasáide eachtracha in Éirinn le fáil ón suíomh gréasáin Roinn Gnóthaí Eachtracha agus Trádála

source: You can check the internet and the local papers for information about jobs and accommodation
ga: Is féidir an t-idirlíon agus na páipéir a sheiceáil chun eolas faoi phoist a fháil

source: If you have a further or higher education qualification, you can find out if your qualifications are recognised abroad
ga: Má tá cáilíocht ardoideachais nó breisoideachais agat d'fhéadfá faigh amach an bhfuil do cháilíochtaí aitheanta thar lear

source: Contact the Irish embassy or consulate of the country where you will be working to find out as much as you can in advance of travel
ga: Téigh i dteagmháil le hambasáid nó le consalacht na hÉireann sa tír ina mbeidh tú ag obair d'fhonn an oiread faisnéise agus is féidir a fháil roimh thaisteal ann duit

source: (This is especially important regarding regarding entry visa and work permit requirements)
ga: (Tá tábhacht faoi leith leis seo maidir leis na riachtanais i dtaobh víosaí iontrála agus cead oibre)

source: Other useful sources of information are immigrant, expatriate or Irish organisations in the country where you are going to live and work
ga: Is foinsí eile úsáideacha iad eagraíochtaí inimirceacha, easaoránacha nó Éireannacha sa tír ina mbeidh tú i do chónaí agus ag obair

source: Below is an overview of the requirements to go to the USA, Canada, Australia, and New Zealand:
ga: Seo thíos forbhreathnú ar na riachtanais chun taisteal chuig Stáit Aontaithe Mheiriceá, Ceanada, an Astráil agus an Nua Shéalainn:

source: You need a visa to go to Australia to work
ga: Teastaíonn víosa uait chun dul chuig an Astráil ag obair

source: The Australian Department of Immigration and Border Protection's website has information for people coming to work in Australia
ga: Tá faisnéis do dhaoine atá ag teacht chun oibriú san Astráil le fáil ar láithreán gréasáin na Roinne Inimirce agus Saoránachta san Astráil

source: A SkillSelect service allows intending migrants indicate their interest in applying for a skilled visa
ga: Tá seirbhís SkillSelect nua ann a cheadaíonn imircigh a spéis in iarratas ar víosa oilte a léiriú

source: You can read about changes to the Skilled Occupations List
ga: Tá athruithe á fáil ar an liosta gairmeacha oilte

source: You will need to know about skills assessment
ga: Is féidir leat faisnéis a fháil faoi measúnú scileanna

source: There is a working holiday visa for young adults, aged 18-30, that allows them to live and work in Australia for a year
ga: Tá víosa saoire oibre ann do dhaoine fásta óga, atá 30 bliana d’aois nó níos óige, a chuireann ar a gcumas cónaí agus oibriú san Astráil ar feadh bliana

source: If you want to go to live and work permanently in Canada there are different visas for immigrants such as skilled workers and family sponsorship
ga: Más mian leat dul chun cónaí agus oibriú go buan i gCeanada, tá víosaí éagsúla d’inimircigh ann, cosúil le hoibrithe oilte agus oibrithe faoi urraíocht teaghlaigh

source: From 4 May 2013 applications will be accepted for a new Federal Skilled Worker Program (FSWP) with revised selection criteria
ga: Ó 4 Bealtaine 2013 glacfar iarratais ar Chlár Feidearálach d’Oibrí Oilte nua le critéir roghnúcháin leasaithe

source: Find out more information about working in Canada and the recognition of foreign qualifications in Canada
ga: Is féidir leat faisnéis a fháil faoi oibriú i gCeanada agus faoi aitheantas do cháilíochtaí eachtracha i gCeanada

source: Since 2013, the International Experience Canada programme allows students and people aged under 35 to live and work in Canada for up to 2 years
ga: Ó 2013, cuireann Taithí Idirnáisiúnta Ceanada ar chumas dhaoine óga cónaí agus oibriú i gCeanada ar feadh suas go dtí 2 bhliain

source: You need a visa to travel to work in New Zealand
ga: Teastaíonn víosa uait chun dul chuig an Nua Shéalainn ag obair

source: The skilled migrant visa is the most usual way of getting permission to work in New Zealand
ga: Is é an víosa an imircigh oilte an gnáthbhealach a fhaightear cead oibriú sa Nua Shéalainn

source: These visas are granted according to a points system based on your qualifications and skills
ga: Tugtar na víosaí seo de réir córais phointí atá bunaithe ar cháilíochtaí agus ar scileanna

source: If you are thinking of working in New Zealand you should get information about recognition of your qualifications
ga: Má tá tú ag cuimhneamh ar oibriú sa Nua Shéalainn, is féidir leat faisnéis faoi aitheantas do cháilíochtaí a fháil

source: The New Zealand Government Immigration website has information about working in New Zealand
ga: Tá faisnéis faoi oibriú sa Nua Shéalainn ar láithreán gréasáin Inimirce Rialtas na Nua Shéalainne

source: The working holiday visa scheme allows young adults aged 18-30 to live and work in New Zealand for a year
ga: Cuireann an scéim víosa saoire oibre ar chumas dhaoine fásta óga, atá 30 bliana nó níos óige, cónaí agus oibriú sa Nua Shéalainn ar feadh bliana

source: If you want to move to the USA to work you will need an immigrant visa
ga: Más mian leat bogadh go Stáit Aontaithe Mheiriceá beidh víosa inimircigh ag teastáil uait

source: Information about visas to migrate to the United States (US) is available on the website of the US embassy in Dublin
ga: Tá faisnéis faoi víosaí chun dul ar imirce chuig na Stáit Aontaithe ar fáil ar láithreán gréasáin ambasáid na Stáit Aontaithe i mBaile Átha Cliath

source: You can also check the US Department of State Bureau of Consular Affairs specific visa information website
ga: Is féidir leat féachaint ar suíomh gréasáin faisnéise víosa sainiúil an Bhiúró um Ghnóthaí Consalacha de chuid Roinn Stáit na Stáit Aontaithe freisin

source: There are different types of immigrant visas, most are based on sponsorship by a family member or a prospective employer
ga: Tá cineálacha éagsúla víosaí inimircigh ar fáil, tá an formhór díobh bunaithe ar urraíocht ó bhall teaghlaigh nó ó fhostóir ionchais

source: Another way to get a visa is to enter the Diversity Visa lottery
ga: Bealach eile chun víosa a fháil ná cur isteach ar an gcrannchur Víosa Ilchineálachta

source: You can find information on recognition of qualifications in USA on the US Department of Education website
ga: Gheobhaidh tú faisnéis maidir le haitheantas do cháilíochtaí i Stáit Aontaithe Mheiriceá ar láithreán gréasáin Roinn Oideachais na Stát Aontaithe

source: The Intern Work and Travel Programme allows qualifying Irish post-secondary students and recent graduates to work and travel as interns in the US for up to 12 months
ga: Tugann an Clár um Thaisteal agus Obair Intéirnigh deis do scoláirí iarbhunscoile agus céimithe nua Éireannacha oibriú agus taisteal mar intéirnigh i Stáit Aontaithe Mheiriceá ar feadh suas le 12 mhí

source: You apply through a designated sponsor organisation
ga: Is féidir leat iarratas a dhéanamh trí eagraíocht urraithe sannta

source: Crosscare Migrant Project has published a guide to the Intern Work and Travel Programme (pdf)
ga: Tá treoir don Chlár um Thaisteal agus Obair Intéirnigh (pdf) arna fhoilsiú ag an Crosscare Migrant Project

source: Working holiday schemes are agreements between countries which allow young adults to go to live and work in another country for a year
ga: Is comhaontuithe idir tíortha atá i scéimeanna saoire oibre a chuireann ar chumas dhaoine óga dul chun cónaí agus oibriú i dtír eile ar feadh bliana

source: Ireland has working holiday agreements in place with the governments of Argentina, Chile, Australia, Canada, Hong Kong, Japan, New Zealand, Korea and Taiwan
ga: Tá comhaontuithe saoire oibre ar bun idir Éire agus rialtais na dtíortha seo a leanas - an Airgintín, an tSile, an Astráil, Ceanada, Hong Cong, an tSeapáin, an Nua Shéalainn, an Choiré agus an Téaváin

source: Ireland also has an agreement with USA for a 12-month work and travel programme for young adults
ga: Tá comhaontú idir Éire agus Stáit Aontaithe Mheiriceá freisin do chlár 12 mhí oibre agus taistil do dhaoine fásta óga

source: Information and application details are in the Guide to Working Holiday Schemes published by Crosscare Migrant Project
ga: Tá faisnéis agus sonraí iarratais san Guide to Working Holiday Schemes arna fhoilsiú ag an Crosscare Migrant Project

source: See above for more details of working holidays in Australia, Canada, New Zealand and USA
ga: Féach thuas chun tuilleadh faisnéise a fháil maidir le saoirí oibre san Astráil, i gCeanada, sa Nua Shéalainn agus i Stáit Aontaithe Mheiriceá

source: What to do before you leave
ga: Cad atá á dhéanamh agat roimh imeacht duit

source: The following is a checklist of what you should consider before going:
ga: Tá liosta de na rudaí nach mór a chur san áireamh roimh imeacht mar a leanas:

source: • What are the visa and/or work permit requirements?
ga: • Céard iad na riachtanais a bhaineann le víosa/údaráis oibre?

source: • What employment protection measures are in force (for example, unfair dismissals, maternity leave)?
ga: • Cén cosaint fostaíochta atá i bhfeidhm (mar shampla, briseadh éagórach, saoire mháthaireachais,)?

source: • What healthcare facilities are available to me?
ga: • Cén áiseanna sláinte atá ar fáil?

source: • Am I required to have any vaccinations before I can travel?
ga: • An dteastaíonn aon vacsaíniú uaim roimh thaisteal?

source: • What accommodation/tenancy rights are in force?
ga: • Cén cearta lóistín atá i bhfeidhm?

source: • What is the tax situation?
ga: • Cén chaoi a bhfuil an córas cánach?

source: Does Ireland have a tax agreement with the country?
ga: An bhfuil comhaontú um chánachas dúbailte ag an tír leis an tír seo?

source: • What is the social security position?
ga: • Céard iad na socruithe leasa shóisialaigh?

source: Does Ireland have a bilateral agreement with the country that will allow you to combine contributions paid in both countries towards certain pension rights, including disability
ga: An bhfuil comhaontú déthaobhach ag Éire leis an tír sin a thabharfaidh cead duit na ranníocaíochtaí a íocann tú sa dá thír a chur le chéile ar mhaithe le cearta áirid pinsin, pinsean míchumais san áireamh

source: There is more information in our document about leaving Ireland and your social security entitlements
ga: Tá tuilleadh eolais maidir le do chearta leasa shóisialta agus tú ag fágáil Éireann

source: • Money – you should bring enough to support you and your family until you find a job, including some months’ rent and deposit
ga: • Airgead - ba chóir duit dóthain airgid, lena n-áirítear cíos i gcomhar roinnt míosa agus éarlais, a thabhairt leat chun tusa agus do chlann a thacú go dtí go mbeidh jab agat

source: Check if you can access your Irish bank account
ga: Faigh amach más féidir leat rochtain ar do chuid cuntas bainc Éireannach a bheith agat

source: • Travel insurance and medical insurance
ga: • Árachas taistil agus árachas sláinte

source: • Leave your contact details with someone at home who can pass them to the Consular Section of the Department of Foreign Affairs and Trade in the event of an emergency
ga: • Do shonraí teagmhála féin a fhágáil le duine sa bhaile a bheidh ábalta iad a thabhairt do Rannóg Consalachta na Roinne Gnóthaí Eachtracha agus Trádála i gcás éigeandála

source: You can also register your contact details with the Department of Foreign Affairs and Trade
ga: Is féidir leat freisin do shonraí teagmhála féin a chlárú sa Roinn Gnóthaí Eachtracha agus Trádála

source: Documents you should bring with you
ga: Na cáipéis gur ceart duit a thabhairt leat:

source: • Passport or other required identification
ga: • Pas nó fianaise aitheantais eile riachtanach

source: • Visa or work permit, if required
ga: • Víosa nó cead oibre

source: • Certificates of qualifications: degree, training certificates, driving licence
ga: • Teastais cáilíochtaí: céim, teastais traenála, ceadúnas tiomána

source: • CV, employment record and references
ga: • CV, taifead fostaíochta agus teistiméireachtaí

source: • Birth and marriage certificates
ga: • Teastas breithe agus pósta

source: • Return ticket so you can come back to Ireland if you can’t find work or accommodation
ga: • Ticéid fillte chun teacht ar ais in Éirinn, mura féidir leat obair nó cóiríocht a fháil

source: Some countries may require you to have a return ticket before entry
ga: • Sonraí teagmhála do chlainne agus do chairde a fhágáil leis an ambasáid nó consalacht Éireannach is gaire duit

source: • Contact details of family and friends to be left with the nearest Irish embassy or consulate
ga: • Sonraí teagmhála do chlainne agus do chara a fhágáil leis an ambasáid nó consalacht is gaire duit

source: Further information and a leaflet about leaving Ireland (pdf) to work abroad are available on the Crosscare Migrant Project website
ga: Tá tuilleadh faisnéise agus bileog maidir le Éire a fhagáil (pdf) chun oibriú thar lear ar fáil ar suíomh gréasáin Crosscare Migrant Project
